<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="observation" type="Parameter" version="opset1">
			<data shape="1,48" element_type="f16" />
			<output>
				<port id="0" precision="FP16" names="observation">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="network.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="400, 48" offset="0" size="38400" />
			<output>
				<port id="0" precision="FP16" names="network.0.weight">
					<dim>400</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="node_linear/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>400</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_2362" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400" offset="38400" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="node_linear" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="linear">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="node_Elu_4" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="val_4">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="network.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="200, 400" offset="39200" size="160000" />
			<output>
				<port id="0" precision="FP16" names="network.2.weight">
					<dim>200</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="node_linear_1/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>200</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_2363" type="Const" version="opset1">
			<data element_type="f16" shape="1, 200" offset="199200" size="400" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="node_linear_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>200</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="linear_1">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="node_Elu_8" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="val_8">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="network.4.weight" type="Const" version="opset1">
			<data element_type="f16" shape="100, 200" offset="199600" size="40000" />
			<output>
				<port id="0" precision="FP16" names="network.4.weight">
					<dim>100</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="node_linear_2/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>200</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>100</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_2364" type="Const" version="opset1">
			<data element_type="f16" shape="1, 100" offset="239600" size="200" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="node_linear_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="linear_2">
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="node_Elu_12" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="val_12">
					<dim>1</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="network.6.weight" type="Const" version="opset1">
			<data element_type="f16" shape="12, 100" offset="239800" size="2400" />
			<output>
				<port id="0" precision="FP16" names="network.6.weight">
					<dim>12</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="node_linear_3/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_2365" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12" offset="242200" size="24" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="node_linear_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="linear_3">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="action" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="action">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="action/sink_port_0" type="Result" version="opset1" output_names="action">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2026.0.0-20965-c6d6a13a886-releases/2026/0" />
		<conversion_parameters>
			<input_model value="DIR/robot_dog_ppo_temp.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
